/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "printf_lib.h"                 /* printf使用ライブラリ         */
#include "microsd_lib.h"                /* microSD制御ライブラリ        */
#include "lcd_lib.h"                    /* LCD表示用追加                */
#include "switch_lib.h"                 /* スイッチ追加                 */
#include "data_flash_lib.h"             /* データフラッシュライブラリ   */
#include "isline.h"
#include "isCheck.h"
/************************************************************************/
/* ライン検出処理                                                 */
/* 引数　 start位置　stop位置                                       */
/* 戻り値 0:ラインなし 1:あり                                     */
/************************************************************************/
int check( int start, int stop)
{
	int i;
	int n = 0;
	
	for(i = start; i <= stop; i++){
		n += bi_sensor[i];
	}

	return n;
}

/************************************************************************/
/* クロスライン検出処理                                                 */
/* 戻り値 0:クロスラインなし 1:あり                                     */
/************************************************************************/
int check_crossline( void )
{
	if( White >= 12){
		return 1;
	}else if( White >= 12 ) {
		if(check(0,1) && check(14,15)){
        	return 1;	/* クロスライン発見！ */
    	}else{
			return 0;	/* クロスラインなし  */
		}
	}else{
		return 0;
	}
}

/************************************************************************/
/* 右ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_rightline( void )
{
//	if( White >= 8 && White <= 10 && pos > 0 ) {
//        return 1;	/* 右ハーフライン発見！ */
//    }else{
//		return 0;	/* 右ハーフラインなし  */
//	}
	if( pos  < 30 && pos > -30 && White >= 8){
		if(check(12,13)){
        	return 1;	/* クロスライン発見！ */
    	}else{
			return 0;	/* クロスラインなし  */
		}
	}else{
		return 0;
	}
}

/************************************************************************/
/* 左ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_leftline( void )
{
//	if( White >= 8 && White <= 10 && pos < 0 ) {
//        return 1;	/* 左ハーフライン発見！ */
//    }else{
//		return 0;	/* 左ハーフラインなし  */
//	}
	if( pos  < 30 && pos > -30 && White >= 8){
		if(check(2,3)){
        	return 1;	/* クロスライン発見！ */
    	}else{
			return 0;	/* クロスラインなし  */
		}
	}else{
		return 0;
	}

}
/************************************************************************/
/* 全黒検出処理   			                                            */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_black( void )
{
	
	if( White == 0 ) {
        return 1;	
    }else{
		return 0;	
	}
}
/************************************************************************/
/* 中心検出処理   			                                            */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_center( void )
{
	int i;
	int n = 0;
	
	for(i = 7; i <= 8; i++){
		n += bi_sensor[i];
	}

	if( n >= 1 ) {
        return 1;	/* 中心発見！ */
    }else{
		return 0;	/* 中心なし  */
	}

}
