/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "printf_lib.h"                 /* printf使用ライブラリ         */
#include "microsd_lib.h"                /* microSD制御ライブラリ        */
#include "lcd_lib.h"                    /* LCD表示用追加                */
#include "switch_lib.h"                 /* スイッチ追加                 */
#include "data_flash_lib.h"             /* データフラッシュライブラリ   */
#include "isline.h"
#include "isCheck.h"
/************************************************************************/
/* ライン検出処理                                                 */
/* 引数　 start位置　stop位置                                       */
/* 戻り値 0:ラインなし 1:あり                                     */
/************************************************************************/
int check( int start, int stop)
{
	int n = 0;
	
	for(i = start; i <= stop; i++){
		n += bi_sensor[i];
	}

	return n;
}

/************************************************************************/
/* クロスライン検出処理                                                 */
/* 戻り値 0:クロスラインなし 1:あり                                     */
/************************************************************************/
int check_crossline( void )
{
	int i;
	int n;
	
	n = check(0,1);
	n *= check(14,15);

	if( n >= 3 ) {
        return 1;	/* クロスライン発見！ */
    }else{
		return 0;	/* クロスラインなし  */
	}
}

/************************************************************************/
/* 右ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_rightline( void )
{
	int i;
	int n;
	
	n = check(14,15);

	if( n >= 2 ) {
        return 1;	/* 右ハーフライン発見！ */
    }else{
		return 0;	/* 右ハーフラインなし  */
	}
}

/************************************************************************/
/* 左ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_leftline( void )
{
	int i;
	int n;
	
	n = check(0,1);

	if( n >= 2 ) {
        return 1;	/* 左ハーフライン発見！ */
    }else{
		return 0;	/* 左ハーフラインなし  */
	}
}
/************************************************************************/
/* 全黒検出処理   			                                            */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_black( void )
{
	int i;
	int n;
	
	n = check(0,15);
	if( n == 0 ) {
        return 1;	
    }else{
		return 0;	
	}
}
/************************************************************************/
/* 中心検出処理   			                                            */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_center( void )
{
	int i;
	int n;
	
	n = check(6,9);

	if( n >= 2 ) {
        return 1;	/* 中心発見！ */
    }else{
		return 0;	/* 中心なし  */
	}

}
