/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "printf_lib.h"                 /* printf使用ライブラリ         */
#include "microsd_lib.h"                /* microSD制御ライブラリ        */
#include "lcd_lib.h"                    /* LCD表示用追加                */
#include "switch_lib.h"                 /* スイッチ追加                 */
#include "data_flash_lib.h"             /* データフラッシュライブラリ   */
#include "drive.h"
#include "trace.h"
#include "camera.h"
#include "isEncoder.h"

/* エンコーダ関連 */
int				iTimer10;			   	/* 10msカウント用		  	*/
int   			iEncoder;			   	/* 10ms毎の最新値		   	*/
int				pre_iEncoder;			/* 前の速度					*/
int				Acceleration;			/* 加速度					*/
unsigned long   lEncoderTotal;		  	/* 積算値保存用				*/
unsigned int	uEncoderBuff;		   	/* 計算用　割り込み内で使用 */
unsigned long	tripmeter_set;			/* トリップメーターのセット	*/


/************************************************************************/
/* オドメーターの初期設定                                               */
/************************************************************************/
void odometer_ini(void)
{
	lEncoderTotal = 0;
}
/************************************************************************/
/* オドメーター			                                                */
/* 走行距離																*/
/************************************************************************/
long odometer(void)
{
	return (float)lEncoderTotal*(3.14*21.0/72.0);
}

/************************************************************************/
/* トリップメーターの初期設定                                               */
/************************************************************************/
void tripmeter_ini(void)
{
	tripmeter_set = lEncoderTotal;
}
/************************************************************************/
/* トリップメーター			                                                */
/* 走行距離																*/
/************************************************************************/
long tripmeter(void)
{
	return (float)(lEncoderTotal - tripmeter_set)*(3.14*21.0/72.0);
}

/************************************************************************/
/* 速度メーター			                                                */
/************************************************************************/
int speedmeter(void)
{
	return iEncoder;
}
/************************************************************************/
/* end of file                                                          */
/************************************************************************/